# Exercise


In exercise foider (same level as this notebook on github)
there is hiring.cs. This file contains hiring statics for a firm 
such as experience of candidate, his written test score 
and personal interview score. Based on these 3 factors, 
HR will decide the salary. Given this data, you need to
build a machine leaming model for HR department that can help them decide
salaries for future candidates. Using this predict salaries for following 
candidates,


2 yr experience, 9 test score, 6 interview score
12 yr experience, 10 test score, 10 interview score

In [63]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
from sklearn import linear_model
from word2number import w2n

In [97]:
df = pd.read_csv("hiring.csv")

#filling the NaN values by Zero

df.experience = df.experience.fillna("zero")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [99]:
df.experience = df.experience.apply(w2n.word_to_num)
df

ValueError: Type of input is not string! Please enter a valid number word (eg. 'two million twenty three thousand and forty nine')

In [72]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [92]:
df["test_score(out of 10)"]

0    7
1    7
2    7
3    7
4    7
5    7
6    7
7    7
Name: test_score(out of 10), dtype: int64

In [93]:
#removing the NaN value of test_score(out of 10)
import math
median_test_score = math.floor(df["test_score(out of 10)"].mean())
median_test_score

7

In [91]:
df["test_score(out of 10)"].fillna(median_test_score)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                      7                           9      50000
1           0                      7                           6      45000
2           5                      7                           7      60000
3           2                      7                          10      65000
4           7                      7                           6      70000
5           3                      7                          10      62000
6          10                      7                           7      72000
7          11                      7                           8      80000